{"meta":{"title":"HodlerStreet","subtitle":"HodlerStreet","description":null,"author":null,"url":"http://hodlerstreet.com"},"pages":[{"title":"about","date":"2018-01-06T19:08:01.000Z","updated":"2018-01-06T19:11:19.642Z","comments":true,"path":"about/index.html","permalink":"http://hodlerstreet.com/about/index.html","excerpt":"","text":""},{"title":"coming","date":"2018-01-06T20:01:33.000Z","updated":"2018-01-06T20:31:32.820Z","comments":true,"path":"coming/index.html","permalink":"http://hodlerstreet.com/coming/index.html","excerpt":"","text":""}],"posts":[{"title":"How serious should a hodler follow McAfee?","slug":"1","date":"2018-01-07T08:17:43.000Z","updated":"2018-01-07T09:55:06.687Z","comments":true,"path":"2018/01/07/1/","link":"","permalink":"http://hodlerstreet.com/2018/01/07/1/","excerpt":"","text":"Someone who has been in the cryptocurrency space sometime now, must have seen McAfee being a dominant figure. The guy is definitely a strong advocate of cryptocurrencies. But the question arises how serious he actually is about cryptocurrencies and whether should someone follow his advice? Well, YES and NO. Why No? Let’s just cut to the chase, he talks shit. I mean, just name the coins he has vouched for over the crypto boom period - DigiByte(DGB), Burst, Kilowatt Hour Coin (KWH), Electronium (ETN) and more. If you go by the backgrounds of the coins he has vouched for, it is awful. Crypto Experts have often criticized him for market manipulation and shouting out coins which really have no core developer team and their projects are a mere marketing gimmick or micro changes on top of really solid crypto projects. Most of the coins have him as an advisor and hence it is quite obvious to see why they appear on his twitter timeline. Recent ICOs like Bob’s Repair are good friends to him, and you shouldn’t be surprised when you see their mention as well. Wait did I mention about his endorsing price. Shhhh…. , it needs to be kept under wraps! Why YES? Even though McAfee lost most of his $100 million fortune he earned through his company, we just cannot neglect the fact that he was one of the greatest internet pioneers of all time. And that blue tick on his twitter is clearly indicative of the fact that he influences decisions. In this case, coins. Cheap ones. One of his tweets made Verge(XVG), a relatively unknown coin surge almost 800% in one week! See for yourself. He is currently buying low market cap coins before tweeting and selling them 2x to 5x profit after the wave travels. Recently, he has started tweeting about one alt each day which are relatively lower in the pecking order in terms of market cap. Massive pumps are being witnessed each day in the coin he tweets about. It’s truly a Christmas come early for day traders who grab a few of those just as he tweets. Easy money I would say! ConclusionAll in all, if you are someone who are haunted by the idea of constant checking of your phone to track micro movements in the prices, day trading is definitely not for you and hence you are better off betting on more stabler coins such as Ethereum, Litecoin or Bitcoin. In such a case, never follow his coins. If you are an opportunist, who wants to remain in this game longer, breath crypto in a more active state and hodl on good coins before they become mainstream, you may look into his coins but DYOR by reading whitepapers before going all in. But if you are someone who lives graphs and are/aspire to become a crypto trader, he is definitely the guy to follow for you. Just take the 2x profit from his coins each day as he announces cheap alts and sell before the dawn in your quest to become a crypto millionaire. If you found the article helpful, please share and subscribe to our social media channels. Sourcehttps://i.ytimg.com/vi/fKP0C8zA7_Q/maxresdefault.jpg http://cdni.wired.co.uk/1240x826/k_n/McAfee.jpg https://img.thedailybeast.com/image/upload/v1492109455/articles/2016/09/12/libertarian-presidential-hopeful-john-mcafee-accused-of-rape-and-murder-in-explosive-new-doc/160911-Yamato-Gringo-The-Dangerous-Life-of-John-McAfee-tease_zmt qjg.jpg","categories":[],"tags":[{"name":"Crypto","slug":"Crypto","permalink":"http://hodlerstreet.com/tags/Crypto/"},{"name":"Hodlerstreet","slug":"Hodlerstreet","permalink":"http://hodlerstreet.com/tags/Hodlerstreet/"},{"name":"Hodler","slug":"Hodler","permalink":"http://hodlerstreet.com/tags/Hodler/"},{"name":"McAfee","slug":"McAfee","permalink":"http://hodlerstreet.com/tags/McAfee/"},{"name":"Bitcoin","slug":"Bitcoin","permalink":"http://hodlerstreet.com/tags/Bitcoin/"},{"name":"Cryptocurrency","slug":"Cryptocurrency","permalink":"http://hodlerstreet.com/tags/Cryptocurrency/"},{"name":"Blockchain","slug":"Blockchain","permalink":"http://hodlerstreet.com/tags/Blockchain/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-01-06T17:56:00.000Z","updated":"2018-01-07T09:55:06.689Z","comments":true,"path":"2018/01/06/hello-world/","link":"","permalink":"http://hodlerstreet.com/2018/01/06/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}