{"meta":{"title":"HodlerStreet","subtitle":"HodlerStreet","description":null,"author":"HodlerStreet","url":"http://hodlerstreet.com"},"pages":[{"title":"","date":"2018-05-31T17:39:04.350Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"OneSignalSDKUpdaterWorker.js","permalink":"http://hodlerstreet.com/OneSignalSDKUpdaterWorker.js","excerpt":"","text":"importScripts('https://cdn.onesignal.com/sdks/OneSignalSDK.js');"},{"title":"","date":"2018-05-31T17:39:04.350Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"OneSignalSDKWorker.js","permalink":"http://hodlerstreet.com/OneSignalSDKWorker.js","excerpt":"","text":"importScripts('https://cdn.onesignal.com/sdks/OneSignalSDK.js');"},{"title":"About","date":"2018-01-06T19:08:01.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"about/index.html","permalink":"http://hodlerstreet.com/about/index.html","excerpt":"","text":""},{"title":"contact","date":"2018-01-11T19:07:29.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"contact/index.html","permalink":"http://hodlerstreet.com/contact/index.html","excerpt":"","text":""},{"title":"Store","date":"2018-01-06T20:01:33.000Z","updated":"2018-05-31T17:39:04.354Z","comments":true,"path":"store/index.html","permalink":"http://hodlerstreet.com/store/index.html","excerpt":"","text":""}],"posts":[{"title":"Sharding In Blockchains - I","slug":"9","date":"2018-06-06T18:13:23.000Z","updated":"2018-06-06T10:26:01.598Z","comments":true,"path":"Technology/sharding-in-blockchains-i/","link":"","permalink":"http://hodlerstreet.com/Technology/sharding-in-blockchains-i/","excerpt":"","text":"Disclaimer: The views in this blog are based upon my personal opinion. Please invest in ICOs after careful research and at your own risk. Sharding is not a new concept. Sharding in traditional databases was implemented a long ago in order to make databases more scalable. But sharding in blockchains is an exciting concept. It is much more harder to implement and wasn&#39;t required until now. Sharding is quite complex so I am going to write a series of blogs discussing sharding in general, various sharding techniques and in the later blogs I will delve deeper into the technical know hows about sharding and sharding as proposed by Ethereum. As of now I can&#39;t decide on the number of blogs, but there are going to be a three or four blogs discussing this topic. If you have been following blockchains for some time you must have come across blockchain scalability issues. The number of on-chain transactions in the Bitcoin network is limited between 3-7 transactions per second. In the Ethereum , this number is capped at around 15. This is a serious issue as compared to Visa and Mastercard where this number reaches a few thousands. This means that at this rate the use of cryptocurrencies for micro transactions is not feasible. You can&#39;t go to coffee shop and pay using crypto. The reason for this sluggish speed is the current protocol for consensus mechanism. In the current scenario, all the transactions are stored and verified by all the nodes on the blockchain network and as the network size increases, the transactions take longer to confirm. We can already see that interest in distributed ledger technologies is increasing rapidly and this problem is only going to worsen. Also, as the number of transactions increases, so will the storage space required to store the blockchain increase, which also poses a challenge to use of blockchains for micro transactions. Current SolutionsBlockchain developers all over the world have come up with a number of solutions to address this issue of scalability. Some of these are off-chain solutions which handle majority of the transactions on side networks like the Lightning Network about which I will discuss in some later blog. Then there are on-chain like the Bitcoin soft fork SegWit and sharding about which I am going to discuss in this blog. There are also some other trivial but flawed solutions which are discussed in the hyperlink. ShardingSharding means breaking. In context of blockchain, it means breaking the network or transactions or states (as discussed later) in order to introduce parallelization because in blockchains, transactions are validated and verified in a sequential manner. The idea is similar to setting up multiple toll booths instead of a single toll booth so that multiple vehicles can be taxed simultaneously instead of a taxing vehicles one by one in a sequential method. Similarly, in blockchains, the network is sharded in such a way that introduces parallel verification of the transactions so that a higher number of transaction are verified each second. Sharding is a horizontal scaling mechanism which means that scaling is achieved by introducing more nodes into the network. Sharding on centralized databases is easy to implement, but as we move to decentralized systems it becomes much more difficult because inter-shard communication is tougher to implement in decentralized systems. I will discuss various sharding techniques now and the challenges that must be overcome to successfully implement those. Sharding can be implemented in 3 ways: Network Sharding Transaction Sharding State Sharding Network ShardingIn this method, the entire set of nodes is divided into a number of shards. Each shard comes to consensus on a different subset of transactions. This is what Zilliqa has implemented. The main concern in this type of implementation is the creation of shards. Shards have to be created such that no single malicious user can take control of the entire shard. Taking control of a single shard is much easier as compared to taking control of the network. To put things into perspective, if the entire network is divided into 100 shards, then a malicious user only needs to control 1% hash rate of the entire network. This is called a 1% attack. One way to prevent this is to introduce randomization while assigning &#39;shard-id&#39; to the nodes. But this randomness has to be publicly verifiable and uniform. According to this paper, the most readily available source of such randomness is the Merkle root of transactions. If the node doesn&#39;t know in advance about the shard to which the node will be assigned, the risk of 1% attack is minimized. Transaction ShardingTransaction sharding means splitting the transactions such that each shard validates and verifies a mutually exclusive subset of transactions. For instance, if there were only two shards, then one way of dividing the transactions could be on the basis of the last bit (either 0 or 1) of the transaction hash. But this type of splitting is prone to double spend attacks. Suppose a user sends out a double spend transaction and this transaction ends up in some shard different from the one handling the first spending transaction which is a high probability. Then, the second shard would assume that the double spend transaction is not a double spend transaction as it has no way of communicating with the first shard. In such cases chaos will ensue. In order to prevent this efficient cross shard communication is required. But this is a problem in itself. If there are N different shards, then each shard will have to communicate with the other N-1 shards for every transaction in order to avoid double spend attacks. A solution to this could be dividing the transactions on the basis of the account that sent them out. But this solution only works in systems that don&#39;t support smart contract accounts. State ShardingState sharding is what Ethereum has almost implemented. This method improves the scalability of blockchains as well as reduces the amount of data stored on each node. State means the set of all the accounts and their corresponding balances in a blockchain network. Every transaction that happens on the blockchain network changes the state of the network. In state sharding each shard is responsible for a mutually exclusive set of accounts. All transactions that are generated between accounts of the same shard are verified by the same shard nodes easily. But as sweet as state sharding may sound, it doesn&#39;t come without its own plethora of challenges. The first and foremost challenge is inter-shard communication. What will happen if a user wants to send out a transaction to a user is some other shard? Thus effective inter-shard communication and state exchange (which is necessary for verification) is required and this transfer of state of state should be such that it doesn&#39;t clog the system with state exchange messages. Ethereum is planning to implement this by using a method of state merkle trees &amp; receipts which I will discuss in the next blogs of this series. Secondly, in order to prevent attacks on the networks a provision to add new nodes and random reshuffling should be there. Now reshuffling poses a great challenge as well. If some nodes of a shard are shuffled, then they must be given some time to download the data of the new shard and this introduces latency in the network. Thirdly, a problem of data availability may also arise. Think of a scenario in which a shard goes offline due to some attack and all data is lost. Now to avoid hardware redundancy as a measure of fault tolerance has to be introduced. Data has to replicated on backup nodes. But storing all data on some nodes means centralization which defeats the whole purpose of distributed ledger technologies. In conclusion, sharding is definitely a better way to scale blockchains than off-chain solutions but all these issues need to be addressed and properly taken care of before moving ahead. From where I stand, the future of blockchains is secure. If not sharding, then maybe some other method to scale blockchains will definitely be discovered because blockchains are in nascent stage after all. References https://www.finextra.com/pressarticle/73493/zilliqa-tackles-scalability-with-sharding-blockchain https://www.cryptoniam.com/what-is-sharding-blockchain-sharding-explained-detail/ https://bitcoinmagazine.com/articles/op-ed-many-faces-sharding-blockchain-scalability/ https://github.com/ethereum/wiki/wiki/Sharding-FAQ https://eprint.iacr.org/2015/1015.pdf https://blockgeeks.com/guides/what-are-ethereum-nodes-and-sharding/ https://medium.com/prysmatic-labs/how-to-scale-ethereum-sharding-explained-ba2e283b7fce","categories":[{"name":"Technology","slug":"Technology","permalink":"http://hodlerstreet.com/categories/Technology/"}],"tags":[{"name":"Blockchain","slug":"Blockchain","permalink":"http://hodlerstreet.com/tags/Blockchain/"},{"name":"Ethereum","slug":"Ethereum","permalink":"http://hodlerstreet.com/tags/Ethereum/"},{"name":"Scalability","slug":"Scalability","permalink":"http://hodlerstreet.com/tags/Scalability/"},{"name":"Ziliqa","slug":"Ziliqa","permalink":"http://hodlerstreet.com/tags/Ziliqa/"},{"name":"Sharding","slug":"Sharding","permalink":"http://hodlerstreet.com/tags/Sharding/"}]},{"title":"How to Earn From Crypto With Zero Investment","slug":"8","date":"2018-02-21T18:15:18.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"Opinion/how-to-earn-from-crypto-with-zero-investment/","link":"","permalink":"http://hodlerstreet.com/Opinion/how-to-earn-from-crypto-with-zero-investment/","excerpt":"","text":"A lot of people, college students specifically have been intrigued by the CryptoCurrency craze. No wonder, it is called the millennials’ money. But the problem they often face is the lack of fiat currency to invest in. Their parents feel this is Ponzi, so they refuse to invest. And they personally are broke themselves. But what they fail to realise is Crypto could be earned with ZERO investment. Yes, you heard that right! All they need is a little patience and time commitment and you could be the next bootstrapped crypto millionaire. So hold tight while trying to grasp some of the things mentioned below. It might sound alien, but so did Internet in the 1990’s and you definitely don’t want to miss this train. AirdropsSo just like the fiat companies have different market strategies for themselves, there is another one of the strategies that has been working out for crypto companies so far and that is the concept of airdrops. In the crypto universe, companies issue their own cryptocurrency in the open market. Now, in order for a cryptocurrency to thrive, you need a community who supports you, your vision and basically adopts the network that is incentivized by the cryptocurrency. But it is hard to convince people to do so. So these companies basically give away free cryptocurrency usually their own to people who perform certain tasks. It may include social media marketing, may include referrals etc. airdropalert is a great website for people to know about upcoming airdrops. Different companies have different ways to give them away. Mostly new coins are Ethereum based, and hence I would suggest you to create a wallet on myetherwallet.com. Store the private key you generate in some safe place and give away your public address only. Use it to get the free crypto on this wallet. An example of wallet generated is given below. Remember, it’s not necessary that a ethereum wallet will do for each and every coin. They may have different blockchain platform like NEO. So generate a paper wallet for that blockchain differently. If you still don’t get it, just go to their respective telegram channel and ask your question to the community. An example airdrop is of the IOST token which recently got listed to big exchanges like Binance. They had a referral program and people were awarded for marketing it. For each referral, it amounted to about 100 Indian rupees and rising. So watch out for them on a weekly basis. A simple hack to the referral based airdrops is to generate unlimited number of wallets and refer other addresses from one. I am attaching my airdrop screenshot below. Steemit.comSo, I think everyone today posts on Medium if they like writing blogs. It is great way to increase credibility and personal branding for an individual. But it pays zero to its hard working content creators. It just feeds on other people’s work. Adding more to the misery, they suspend accounts on baseless accusations (https://medium.com/@hodlerstreet like us).Came the decentralised medium called Steemit. It pays in its own cryptocurrency to users who maintains the network and creates content for its platform. They have given about $22 million dollars till date. Don’t believe me? Check out the guys’ earnings down below. The way Steemit gives crypto to its content creators without someday going bankrupt is a well crafted economics. If you are interested, you could learn about mechanism design as a subject and their whitepaper. D.tube D.tube is the decentralised youtube. No single entity controls the network. The content creators are paid in somewhat the same way as Steemit. The difference here is ofcourse the handling of the large amount of video content without single point of failure. It uses the IPFS technology which is still in its primitive stage. So the videos are slow to buffer. But here is again an opportunity for you to be an early adopter of the platform. Upload your videos both on Youtube and D.tube, and grow your content business. Cent.coCent.co is the crypto on demand incentivized Q&amp;A platform. You get paid in crypto proportional to the upvotes on the answer you write which further depends on the bounty placed on the question by the person who asked it. I have personally not tested the platform but have read about it, and it seemed quite legit. I am attaching the screenshot below of the platform. Earn.comSo, earn.com basically gives you payments in Bitcoins when someone wants to pay for your time. So for example if you are someone like Gary Vaynerchuk or maybe an expert in ABC domain, instead of just sharing a public email for free, you could be paid by a XYZ person who wants to pay you to spend time with you. So, grow your personal brand, have expertise in some field or the other and create an account on earn.com. As Joker says, “If you are good at something, never do it for free”. By the way, you could contact me on earn.com too. My handle is https://earn.com/rohanagarwal94/. ConclusionCrypto will radicalize the industry in ways hard to comprehend. An average user will be for the first time be genuinely paid for his time irrespective of the decentralised platform he uses. Be an early adopter and you will not regret later.That’s about it, folks. I will try to add more and more decentralised websites in this post when I come across one in the future. I bumped into the website earncrypto.com. I didn’t personally try it but it looked promising enough. Let me know about it in the comments section.On a general note, I would suggest you to avoid quick money schemes in Crypto, and invest time and energy on coins and platforms which are legitimate. I hope to see everyone reading this blog get involved in the crypto space and take ownership of your personal data. Till then, keep hodling!","categories":[{"name":"Opinion","slug":"Opinion","permalink":"http://hodlerstreet.com/categories/Opinion/"}],"tags":[{"name":"passive income","slug":"passive-income","permalink":"http://hodlerstreet.com/tags/passive-income/"},{"name":"crypto","slug":"crypto","permalink":"http://hodlerstreet.com/tags/crypto/"},{"name":"free tokens","slug":"free-tokens","permalink":"http://hodlerstreet.com/tags/free-tokens/"},{"name":"airdrops","slug":"airdrops","permalink":"http://hodlerstreet.com/tags/airdrops/"},{"name":"steemit","slug":"steemit","permalink":"http://hodlerstreet.com/tags/steemit/"}]},{"title":"DAICO - Is this the next generation ICO?","slug":"7","date":"2018-02-21T17:18:25.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"Technology/daico-is-this-the-next-generation-ico/","link":"","permalink":"http://hodlerstreet.com/Technology/daico-is-this-the-next-generation-ico/","excerpt":"","text":"Disclaimer : The views in this blog are based upon my personal opinion. Please invest in ICOs after careful research and at your own risk. Initial Coin Offerings (ICOs) were first introduced with a divine thought of removing the exchanges from the middle and letting the general public interact directly with the project owners. The idea was so brilliant that ICOs gained momentum in a very short amount of time. Everyday one or the other company comes up with its own ICO. But as they say, there are always two sides to a coin. Soon ICOs became a way to earn easy money and even get away with it. I have seen a lot of news and forums about ICOs being fraudulent, or projects not getting completed on time. And then there are coins that really do nothing and people just buy them because it is a crypto token. To avoid all this, discussions have been going on about a way to secure people’s money spent on ICOs. In a recent post on ethresear.ch, Vitalik Buterin came up with a new concept for the ICOs, DAICOs. DAICO stands for Decentralized Autonomous ICO. This combines the ideas of Decentralised Autonomous Organisations(DAOs) and ICOs. DAOs are those organisations, that are not run by a centralised entity but are governed by bylaws that are written as computer code and are immutable and decisions are taken with a consensus process that happens on the blockchain. The power lies in the hands of all the members of the DAO and not just one person.DAICOs mainly use three components of DAOs: Decisions based on popular opinion which benefits the public. Distribution of power in the hands of the general public. Spreading the funds over time instead of giving it all away in a single moment. How does a DAICO work?The company that wants to hold an ICO releases a smart contract which will hold the funds collected during the ICO. The funds are not released to the developers immediately at the end of the ICO but remain locked up in a smart contract, rules of which can only be changed with a consensus of the token holders.A variable called ‘tap’ is introduced. This variable defines the amount of funds that can be withdrawn from the smart contract (in wei/sec). It is initialized to a value of zero. Two types of resolutions can be held after the ICO: Increasing the tap value. Withdrawing the amounts held in the smart contract and distributing the proportionately. The value of tap can only be increased with a consensus vote but it can be decreased by the unilaterally by the owner of the project. How does this benefit me?This solves a lot of problems related to ICOs discussed earlier. This mechanism gives the control of the funds to the general public.The tap amount allows to keep a check on the development of the project. It can be set to a low value initially and gradually increased depending on how much is needed at that moment. In this way the developers cannot run away with the funds because only a certain amount of it is released each second. In case they try to run away, the token holders can always withdraw their funds from the smart contract after organising a vote.Moreover this keeps the developers always working, because now there is a threat that funds can be withdrawn at any moment if the project deadlines are missed.Although there is always a possibility of a 51% attack, but the risk of malicious use of funds is minimized and both the developers and the voters have to be compromised in order to cause a real loss which is as absurd as it sounds. Is this really a one-stop solution the ICO problem?DAICO is a not a silver bullet to all the ICO problems. Of course there are certain limitations to the implementation of DAICOs. The token holders or the voters need to be constantly engaged in the development process of the product and need to be notified of an upcoming resolution well in advance. Also if the developers own a large chunk of the tokens, they can easily sway the consensus result by influencing only a small group of token holders. Then there may be times when the price of the token shoots up to 5x or 6x its initial price due to market speculations and advice of the so called “crypto experts” (Yes, I am talking about you McAfee!). In this case the voters will be reluctant to vote for a self destruct of the contract or lowering the tap value even if the developers are not delivering up to the mark or missing deadlines. In a startup, the timelines are changing continuously and there are certain times when there is an instant need of funds. Voting for this can lead to a lag in the release of funds and a lag in the development; so voting needs to be conducted regularly.People have already started proposing solutions to these problems like linking the tap value to something tangible like an alpha release, a beta release and so on. This active participation shows that this idea is definitely something and people have already started basing their ICOs on this new mechanism. Abyss is holding the world’s first DAICO. References https://themerkle.com/vitalik-buterin-releases-revolutionary-new-daico-model-for-icos/ https://cointelegraph.com/explained/what-is-a-daico-explained https://medium.com/new-alchemy/is-vitaliks-daico-a-better-version-of-the-ico-7ed7abbe6355 https://ethresear.ch/t/explanation-of-daicos/465 https://www.reddit.com/r/vergecurrency/comments/7ndeex/missed_three_deadlines_now/","categories":[{"name":"Technology","slug":"Technology","permalink":"http://hodlerstreet.com/categories/Technology/"}],"tags":[{"name":"Cryptocurrency","slug":"Cryptocurrency","permalink":"http://hodlerstreet.com/tags/Cryptocurrency/"},{"name":"Ethereum","slug":"Ethereum","permalink":"http://hodlerstreet.com/tags/Ethereum/"},{"name":"ICO","slug":"ICO","permalink":"http://hodlerstreet.com/tags/ICO/"},{"name":"DAO","slug":"DAO","permalink":"http://hodlerstreet.com/tags/DAO/"},{"name":"Decentalisation","slug":"Decentalisation","permalink":"http://hodlerstreet.com/tags/Decentalisation/"}]},{"title":"Is Ethos the answer to key management problem?","slug":"6","date":"2018-02-01T10:25:27.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"Coin-Review/is-ethos-the-answer-to-key-management-problem/","link":"","permalink":"http://hodlerstreet.com/Coin-Review/is-ethos-the-answer-to-key-management-problem/","excerpt":"","text":"Disclaimer : The coins I write about are my personal opinion. Invest in them at your own risk. It has been almost 3 months since I started investing in cryptocurrencies despite studying about it for almost an year now. Hey, don’t curse me just now! We Indians have reservations when we need to spend money on risky business. So, it all started with Ethereum. 2xed my portfolio soon enough. It was awestrucking to me. And then I came to know about other altcoins. Read their whitepapers. Read more. Diversified my portfolio. Started getting better returns than Ethereum alone could manage. And then the greed grew. It became a never ending desire to have a greater return than what I was getting. So I ventured into other relatively smaller exchanges like Kucoin and Cryptopia from Binance, where I could find smaller market cap coins which had the potential to go 50x. And then came the nightmare of maintaining a host number of public keys. And then it occured to me, the problems the whales and experienced traders must have had all this time. So, I explored possible solutions that existed in the market and I bumped into Ethos token. What is the Ethos token?As stated on their website, ETHOS is an access token that enables anybody to securely manage their cryptocurrency wallets, keys and coins. For a more in depth roadmap and vision of the company, I would suggest you to read their whitepaper. Simply put, they are trying to create a democratized economy that makes the cryptocurrency market accessible and trustworthy to the average user, accelerating adoption of blockchain technology and democratizing ownership of both digital and traditional assets. They plan to create a universal wallet to efficiently manage keys with the help of Ethos token and reward people for promoting financial knowledge. Is it the solution?What Ethos is trying to do is definitely a problem worth solving, the reason why they are roughly placed at the 78th position on the CoinMarketCap in terms of market cap. The team they currently compose of have a wealth of experience at their disposal. But there are definitely some points noticing before someone invests in them for the ecosystem they are trying to create. Token AllocationOut of the total 225 million Ethos token, only about 75 million is in circulation. That means about 60-70% of the total supply is kept by the founders. By the cryptocurrency markets in general that is greedy to be honest. Plus when Ripple is somewhat viewed as a centralised currency in the crypto space, I fail to understand why fingers are not raised for this coin on similar grounds. Github RepositoryIf someone is looking to invest in a particular cryptocurrency, reading the source code of the repository somewhat brings trust about the work the company is doing on day to day basis. Now, if you would go searching for Ethos github repository, sorry to disappoint you, you won’t find any. And that’s because they are a closed source project right now. Despite an active telegram group, close sourcing the project is just purely contrary to the belief that the crypto world today is built upon, and sadly a big red flag when it comes to due diligence of a coin. Partial DecentralisationGiven that the Ethos as a company would cater to a Fiat gateway, they will be implementing regulatory measures such as KYC and AML measures which means they will have trust factors introduced in the ecosystem they are trying to create which ultimately may become a roadblock operating and competing with other decentralised options. ConclusionThe problem of key management is undoubtedly a massive problem right now to solve in a decentralised manner. The fact that Stephen Corliss, ex- COO of BlackRock joined Ethos shows the underlying strength of the Ethos team and credibility of the token. What they are trying to achieve is highly ambitious but it remains to be seen whether they truly deliver what they envision given the questioning decisions they have taken so far. References https://coinmarketcap.com/currencies/ethos/ https://www.ethos.io/ https://www.reddit.com/r/ethos_io/ https://www.reddit.com/r/ethos_io/comments/7t9stg/1_wallet_owns_66_of_all_ethos_tokens/ https://www.altcoinss.com/news/news-what-is-ethos-an-in-depth-look-at-the-coin-universal-cryptocurrency-wallet-portfolio-manager?uid=7401","categories":[{"name":"Coin Review","slug":"Coin-Review","permalink":"http://hodlerstreet.com/categories/Coin-Review/"}],"tags":[{"name":"Cryptocurrency","slug":"Cryptocurrency","permalink":"http://hodlerstreet.com/tags/Cryptocurrency/"},{"name":"Coin Review","slug":"Coin-Review","permalink":"http://hodlerstreet.com/tags/Coin-Review/"},{"name":"Binance","slug":"Binance","permalink":"http://hodlerstreet.com/tags/Binance/"},{"name":"Ethos","slug":"Ethos","permalink":"http://hodlerstreet.com/tags/Ethos/"},{"name":"Ethos token","slug":"Ethos-token","permalink":"http://hodlerstreet.com/tags/Ethos-token/"},{"name":"Kucoin","slug":"Kucoin","permalink":"http://hodlerstreet.com/tags/Kucoin/"},{"name":"Cryptopia","slug":"Cryptopia","permalink":"http://hodlerstreet.com/tags/Cryptopia/"}]},{"title":"Is Hashgraph the Thanos of the Crypto Universe?","slug":"5","date":"2018-01-27T14:05:49.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"Technology/is-hashgraph-the-thanos-of-the-crypto-universe/","link":"","permalink":"http://hodlerstreet.com/Technology/is-hashgraph-the-thanos-of-the-crypto-universe/","excerpt":"","text":"IntroductionWhile browsing through the internet, performing mini day trades on Binance and diving more deeper into technology behind the different cryptocurrencies, I bumped into Hashgraph through this video and boy was I blown away. The claims that the founder made in the video caused an existential crisis deep down. Not in real life but definitely in the crypto world. It occured to me as the Thanos waiting for his time to conquer the Avengers’ universe. I had to research more about it. It just seemed too good to be true. And so I did. So what is Hashgraph? Simply put, it is a distributed ledger technology which does not uses Blockchain as its core data structure, is asynchronous Byzantine Fault Tolerant, processes about 250,000 transactions per second, does not use resource intensive consensus algorithms like Proof of Work and gives discrete surety about the confirmation of the transaction. They use two basic algorithms - Gossip protocol and virtual voting. Well that was a mouthful. But it does work. For a more detailed guide into the groundbreaking algorithm I would suggest reading its official whitepaper and if you want to understand it in English, do give this medium post a read. If you want to see a working product built on its Java SDK, you could check this out this devpost. They sponsored the TechCrunch 2017 Hackathon. Do notice the minimal network latency in between the devices. It literally blew my mind when I realised this was without the use of a server. Implications of the Technology We do realise that the technology is breathtaking. I mean they won a contract for delivering the technology to the CULedger serving roughly a 104 million customers (link). So,no doubts about that in my opinion. What I personally want to discuss here are the implications of the technology. One of the best things I found about the technology was its ability to run a light node at will. So what it means is, unlike blockchains which have a probabilistic consensus they have a confirmed consensus. A probabilistic consensus here means that one can never be certain the order of transactions included in the blockchain are indeed correct. The probability only increases as more and more blocks gets added into the single state ledger. A confirmed consensus on the other hand, after a certain number of rounds of voting, the history of the transactions achieves global truth which means a probability of one despite being a non deterministic system. Hence a light node can act as a full node by not storing the history of transactions which have been successfully verified, thereby enabling someone to run a full node on mobile phone itself. My biggest concern around the technology is Swirlds’ decision to put an IP on the technology. On one hand we have blockchain which is promoted as open-sourced solution. Satoshi could have gone on the same path as Hashgraph but that wouldn’t have worked out the way it has. We wouldn’t have a crypto ecosystem that is ever growing like today. Moreover, he/she/they sit on a fortune of roughly around $10 Billion dollars at the current price of bitcoin. Therefore, hashgraph by venturing into the private permissioned networks such as Credit Unions took far lesser challenge with lower growth potential than what it might have been had they released a cryptocurrency themselves and competed in the open markets. Though they plan to release a public protocol in the future, but I doubt they will succeed without open-sourcing their technology altogether. Secondly, they self-proclaim that Hashgraph can sustain about 250,000 transactions per second. They even claim that number in a highly scaled environment. But reputed people in the space like Vitalik Buterin - founder of Ethereum have raised questions on its scalability time and time again. They believe directed acyclic graphs like the hashgraph will face the same issues as them when deployed in a public environment where chances of Sybil attacks are more prominent. Moreover, they argued that even though hashgraph manages to scale itself with a larger pool of transactions, it will not be able to provide the same throughput when a larger number of nodes are drawn into the picture. ConclusionThe beauty of network effect is what is keeping Bitcoin alive today. It has the first mover’s advantage and people are considering it as a digital gold despite its shortcomings. Whether Hashgraph kills the whole cryptocurrency domain remains to be seen, but what Bitcoin has taught us is that whatever the technology is, its the adoption that ultimately wins. References https://www.youtube.com/watch?v=evWBgNdWNDk&amp;list=PLdpkAOPvMcM2J28IRNK8yUmpq7v7bpPfd https://hackernoon.com/demystifying-hashgraph-benefits-and-challenges-d605e5c0cee5 https://blog.springrole.com/what-is-hashgraph-is-it-the-blockchain-killer-3fabc603211 https://hashgraph.com/","categories":[{"name":"Technology","slug":"Technology","permalink":"http://hodlerstreet.com/categories/Technology/"}],"tags":[{"name":"Hashgraph","slug":"Hashgraph","permalink":"http://hodlerstreet.com/tags/Hashgraph/"},{"name":"technology","slug":"technology","permalink":"http://hodlerstreet.com/tags/technology/"},{"name":"data structure","slug":"data-structure","permalink":"http://hodlerstreet.com/tags/data-structure/"},{"name":"DAG","slug":"DAG","permalink":"http://hodlerstreet.com/tags/DAG/"}]},{"title":"What is the INS token and why it is doomed.","slug":"4","date":"2018-01-17T15:23:35.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"Coin-Review/what-is-the-ins-token-and-why-it-is-doomed/","link":"","permalink":"http://hodlerstreet.com/Coin-Review/what-is-the-ins-token-and-why-it-is-doomed/","excerpt":"","text":"Disclaimer : The coins I write about are my personal opinion. Invest in them at your own risk. INS token is a cryptocurrency that aims to decentralize the online grocery ecosystem by removing the middlemen that is the retailers and the wholesalers with the help of Blockchain and smart contract. It is somewhat tackling the reduced market shares of home grown manufacturers by private labels such Amazon Basics and at the same time providing groceries at the cheaper rate to the consumers. Now, as far as the problem statement is concerned, I think is fantastic. But, I am highly sceptical about the industry that they are involved in - hyperlocal grocery. I mean look around yourself and analyse the centralised internet companies existing in the space. None. Practically no single big player. For the existing players, it is just a cycle of endless pivots and venture fundings till they realise that the unit economics is just not sustainable. Hyperlocal startups particularly in the groceries domain face an uphill battle when they try to scale exponentially. They compete with the locals who run grocery carts and are much less likely to lose money on a product with significantly low shelf life than them.If we take an example from the history, I think Webvan completely fits the thought. What started as a revolutionary offline, online hybrid consortium of elements to deliver groceries door-to-door filed a bankruptcy soon after. That’s roughly around a billion dollars of venture capital down the drain. Billion with a ‘b’. And instead of going into the details of why hyperlocal grocery startups generally fail to cement their market positions which is basically just a Google search away, I think I would rather write about the decentralised aspects of the token. Other ProblemsToken Allocation They sit on roughly about 30-40% of the total token size which I feel is high as compared to other coins. Frankly, it is controlling in some sense. Normally, the coins in the market that are in for the long haul and genuinely believe in decentralisation usually house around 10 to 20 percent of the total supply. Therefore, I feel the tokens to be another one of the red flags in the project. Fulfillment Centers Another one of the key areas which drew my attention is the role of fulfillment centers in the whole ecosystem that they are trying to create. Who these fulfillment centers are going to be? Can anyone with a yard of space provide fulfillment services? How will the INS decide who to trust when there is going to more than one in an area?Fulfillment centers in my honest opinion introduces trust in the trustless system that they envision. Plus they plan to employ third party to do the box moving (as mentioned in one of the Q&amp;A sessions with the company’s CEO) which is again does not add up for me. Supply Chain InnovationThey claim that their platform will have blockchain integrated into their supply chain management which I believe is great. But their beta starts not before the quarter of 2018 whereas other decentralised companies in the supply chain domain like WABI, VEN and WTC already have their products involving RFID technology in the working state and partnerships with established companies and governments in place which definitely gives them the first movers’ advantage. ConclusionAll in all I think there are too many moving parts in the system and though I would brand it as somewhat a highly ambitious project, I think there is not much use of the INS token in general in the system. They are basically riding the hype wave and I feel ETH is just as useful in the operations of the ecosystem. Hope they succeed in what they are trying to achieve, but hodling wise, I would prefer to maintain a distance. References https://ins.world/INS-ICO-Whitepaper.pdf http://trak.in/tags/business/2017/09/26/online-grocery-startups-failure/ https://en.wikipedia.org/wiki/Webvan","categories":[{"name":"Coin Review","slug":"Coin-Review","permalink":"http://hodlerstreet.com/categories/Coin-Review/"}],"tags":[{"name":"Cryptocurrency","slug":"Cryptocurrency","permalink":"http://hodlerstreet.com/tags/Cryptocurrency/"},{"name":"Coin Review","slug":"Coin-Review","permalink":"http://hodlerstreet.com/tags/Coin-Review/"},{"name":"INS coin","slug":"INS-coin","permalink":"http://hodlerstreet.com/tags/INS-coin/"},{"name":"INS","slug":"INS","permalink":"http://hodlerstreet.com/tags/INS/"},{"name":"Binance","slug":"Binance","permalink":"http://hodlerstreet.com/tags/Binance/"}]},{"title":"Which are the best exchanges for an Indian to buy Cryptos?","slug":"3","date":"2018-01-08T05:45:42.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"Opinion/which-are-the-best-exchanges-for-an-indian-to-buy-cryptos/","link":"","permalink":"http://hodlerstreet.com/Opinion/which-are-the-best-exchanges-for-an-indian-to-buy-cryptos/","excerpt":"","text":"So a lot of fuzz has been circulating quite a while now in the Indian media about the cryptocurrency and its rise in value. And it is no secret that all the top media companies in the country are influenced by one or the other political parties and hence the government. Even the finance minister of the country Mr. Arun Jaitley has voiced concerns about Bitcoin and other cryptocurrencies. But that is definitely not stopping the Indians enter the mad race to multiply their crypto holdings. Now, buying cryptocurrencies is definitely a herculean task until you familiarize yourself with the whole process. And boy it is heart wrenching when you know one wrong digit in the public address and the funds are lost forever. But fair to say, when you have potential to 5x-10x your investments, I feel it is worth the risky play. Talking about exchanges, the first that comes to mind to an Indian are Indian exchanges. But you know what they really are - They basically cook shit. There have been multiple cases of wallet thefts in the past. Along with that, they are in a constant state of inefficiencies. Sometimes regarding withdrawal of the funds. Other times server down situations. Plus the Indian government literally crack down on them whenever they feel like. And hence it is figuratively a crime to keep your valuable cryptos on the Indian exchanges. The solution Well all’s not doomed for us Indians. The exchanges are good enough to exchange your Fiat currency with the stable cryptos like Bitcoin and Ethereum. Exchanges like throughbit and zebpay have good enough reputation. Or better Coinbase. Though it doesn’t offer insurance outside of United States. Have your KYC done and buy from them. A word of caution though, Bitcoin have high transaction fees and hence if your motive is to trade altcoins, then Ethereum would be much better choice for you to purchase. After the purchase, transfer them to foreign exchanges like Binance , Bittrex , Kucoin or Bitfinex to buy altcoins. I warn you to buy alts from Koinex . It is expected to doom. Exchange to exchange transfers take somewhat more time. Hence it is better if you transfer it to a paper wallet like myetherwallet and then transfer it to a foreign exchange. If you found the article helpful, please share and subscribe to our social media channels.","categories":[{"name":"Opinion","slug":"Opinion","permalink":"http://hodlerstreet.com/categories/Opinion/"}],"tags":[{"name":"Exchange","slug":"Exchange","permalink":"http://hodlerstreet.com/tags/Exchange/"},{"name":"Bitfinex","slug":"Bitfinex","permalink":"http://hodlerstreet.com/tags/Bitfinex/"},{"name":"Bittrex","slug":"Bittrex","permalink":"http://hodlerstreet.com/tags/Bittrex/"},{"name":"Indian Exchange","slug":"Indian-Exchange","permalink":"http://hodlerstreet.com/tags/Indian-Exchange/"},{"name":"Ethereum","slug":"Ethereum","permalink":"http://hodlerstreet.com/tags/Ethereum/"},{"name":"Coinbase","slug":"Coinbase","permalink":"http://hodlerstreet.com/tags/Coinbase/"},{"name":"Throughbit","slug":"Throughbit","permalink":"http://hodlerstreet.com/tags/Throughbit/"}]},{"title":"Introduction to Hardware Wallet in Crypto World","slug":"2","date":"2018-01-07T11:00:00.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"Wallets/introduction-to-hardware-wallet-in-crypto-world/","link":"","permalink":"http://hodlerstreet.com/Wallets/introduction-to-hardware-wallet-in-crypto-world/","excerpt":"","text":"OverviewA hardware wallet is a special type of crypto wallet which stores user’s private keys in a secure hardware device. Two major utilized cryptocurrency hardware wallets currently are Trezor and Ledger. Major advantages over standard wallets are: Private keys are stored in a protected area of a microcontroller, and cannot be transferred out of the device in plain text. Immune to computer viruses that steal from software wallets. Can be used securely and interactively, as opposed to a paper wallet which must be imported to software at some point. Much of the time, the software is open-source allowing a user to validate the entire operation of the device. The main principle behind the hardware wallets is to provide the full isolation between the cryptographic secrets (private keys) and your easy to hack computer or smartphone. Vulnerabilities of modern PCs and smartphones are well known and if you keep your private keys there, it’s just a matter of time before you’ll get hacked and lose your bitcoins. A paper wallet may be secure, but only until you want to use your funds, requiring importing your private keys on your computer. And if you think a password encrypting your keys is enough, a malware is smart enough to wait for the inevitable decryption before sweeping your funds. Hardware wallets are convenient, affordable, portable and backed up by a paper wallet allowing easy recovery in case of loss. If you have any significant amount of bitcoins, using a hardware wallet should be a no brainer. SeedThe recovery seed usually contains a sequence of 24 words uniquely and securely generated inside your hardware wallet, when you first set it up. It is of utmost importance to keep this backup sentence secret and safe. In case your wallet is lost you can recover your wallet with recovery seed. Trezor Wallet Trezor is the hardware device that hosts the wallet. As in a normal wallet that we use on a daily basis there are pouches for different things like one for driving licence and other for money and further sections depending on the stuff you are carrying. Similarly wallet in Trezor, there are separate pouches for different currencies one for Bitcoin, one for Ethereum, also for your U2F identity, etc. Everything you need is in one wallet. Each seed generates only one wallet. Unlike a wallet, for which you only have one per seed, you can have many accounts (for every currency separately). Compare this to your bank accounts — you might have a Checking account and a Savings account. As they are separate accounts, they are completely independent, save from the fact that they are generated from the same seed. Account 1 does not see what is in Account 2, etc. Ledger Nano S Ledger Nano S is a secure Bitcoin and Ethereum hardware wallet. It connects to any computer through USB and embeds a built-in OLED display to double check and confirm each transaction with a single tap on its side buttons. To date there have been no verifiable incidents of Bitcoins stolen from hardware wallets. Hardware wallets are relatively new, but at least for the time being they have maintained a good track record, unlike the numerous incidents of Bitcoin theft from Internet-connected computers. How a hardware wallet cannot protect your Bitcoins Malware swaps recipient bitcoin address - During serial communication when recipient address in sent to hardware device for signing the transaction, malware can swap the actual address and the transaction would be signed for hacker’s bitcoin address. Insecure RNG (Random Number Generator) - hardware wallets rely on the security of an RNG, often embedded in hardware, to generate your wallet’s private keys securely. Unfortunately, it is notoriously difficult to verify the true randomness of the RNG. An insecure RNG may create wallet keys that can later be recreated by an attacker, by generating pseudo-randomness that would seem statistically indistinguishable from true randomness yet still be predictable to an advanced attacker. Compromised production process - even a perfect software and hardware implementation of a hardware wallet would be vulnerable to a corrupt production process that introduces intentional or unintentional holes into the final product. The introduction of hardware backdoors is a real concern for high risk financial and military applications. References https://cointelegraph.com/news/hardware-bitcoin-wallets-not-vulnerable-to-spectre-attacks-funds-safe https://en.bitcoin.it/wiki/Hardware_wallet https://blog.trezor.io/ https://www.ledger.fr/2016/06/20/ledger-nano-s-secure-multi-currency-hardware-wallet/","categories":[{"name":"Wallets","slug":"Wallets","permalink":"http://hodlerstreet.com/categories/Wallets/"}],"tags":[{"name":"Crypto Wallet","slug":"Crypto-Wallet","permalink":"http://hodlerstreet.com/tags/Crypto-Wallet/"},{"name":"Hardware Wallet","slug":"Hardware-Wallet","permalink":"http://hodlerstreet.com/tags/Hardware-Wallet/"},{"name":"Trezor","slug":"Trezor","permalink":"http://hodlerstreet.com/tags/Trezor/"},{"name":"Ledger Nano S","slug":"Ledger-Nano-S","permalink":"http://hodlerstreet.com/tags/Ledger-Nano-S/"},{"name":"Security","slug":"Security","permalink":"http://hodlerstreet.com/tags/Security/"}]},{"title":"How serious should a hodler follow McAfee?","slug":"1","date":"2018-01-07T08:17:45.000Z","updated":"2018-05-31T17:39:04.350Z","comments":true,"path":"Opinion/how-serious-should-a-hodler-follow-mcafee/","link":"","permalink":"http://hodlerstreet.com/Opinion/how-serious-should-a-hodler-follow-mcafee/","excerpt":"","text":"Someone who has been in the cryptocurrency space sometime now, must have seen McAfee being a dominant figure. The guy is definitely a strong advocate of cryptocurrencies. But the question arises how serious he actually is about cryptocurrencies and whether should someone follow his advice? Well, YES and NO. Why No? Let’s just cut to the chase, he talks shit. I mean, just name the coins he has vouched for over the crypto boom period - DigiByte(DGB), Burst, Kilowatt Hour Coin (KWH), Electronium (ETN) and more. If you go by the backgrounds of the coins he has vouched for, it is awful. Crypto Experts have often criticized him for market manipulation and shouting out coins which really have no core developer team and their projects are a mere marketing gimmick or micro changes on top of really solid crypto projects. Most of the coins have him as an advisor and hence it is quite obvious to see why they appear on his twitter timeline. Recent ICOs like Bob’s Repair are good friends to him, and you shouldn’t be surprised when you see their mention as well. Wait did I mention about his endorsing price. Shhhh…. , it needs to be kept under wraps! Why YES? Even though McAfee lost most of his $100 million fortune he earned through his company, we just cannot neglect the fact that he was one of the greatest internet pioneers of all time. And that blue tick on his twitter is clearly indicative of the fact that he influences decisions. In this case, coins. Cheap ones. One of his tweets made Verge(XVG), a relatively unknown coin surge almost 800% in one week! See for yourself. He is currently buying low market cap coins before tweeting and selling them 2x to 5x profit after the wave travels. Recently, he has started tweeting about one alt each day which are relatively lower in the pecking order in terms of market cap. Massive pumps are being witnessed each day in the coin he tweets about. It’s truly a Christmas come early for day traders who grab a few of those just as he tweets. Easy money I would say! ConclusionAll in all, if you are someone who are haunted by the idea of constant checking of your phone to track micro movements in the prices, day trading is definitely not for you and hence you are better off betting on more stabler coins such as Ethereum, Litecoin or Bitcoin. In such a case, never follow his coins. If you are an opportunist, who wants to remain in this game longer, breath crypto in a more active state and hodl on good coins before they become mainstream, you may look into his coins but DYOR by reading whitepapers before going all in. But if you are someone who lives graphs and are/aspire to become a crypto trader, he is definitely the guy to follow for you. Just take the 2x profit from his coins each day as he announces cheap alts and sell before the dawn in your quest to become a crypto millionaire. If you found the article helpful, please share and subscribe to our social media channels. Sourcehttps://i.ytimg.com/vi/fKP0C8zA7_Q/maxresdefault.jpg http://cdni.wired.co.uk/1240x826/k_n/McAfee.jpg https://img.thedailybeast.com/image/upload/v1492109455/articles/2016/09/12/libertarian-presidential-hopeful-john-mcafee-accused-of-rape-and-murder-in-explosive-new-doc/160911-Yamato-Gringo-The-Dangerous-Life-of-John-McAfee-tease_zmt qjg.jpg","categories":[{"name":"Opinion","slug":"Opinion","permalink":"http://hodlerstreet.com/categories/Opinion/"}],"tags":[{"name":"Crypto","slug":"Crypto","permalink":"http://hodlerstreet.com/tags/Crypto/"},{"name":"Hodlerstreet","slug":"Hodlerstreet","permalink":"http://hodlerstreet.com/tags/Hodlerstreet/"},{"name":"Hodler","slug":"Hodler","permalink":"http://hodlerstreet.com/tags/Hodler/"},{"name":"McAfee","slug":"McAfee","permalink":"http://hodlerstreet.com/tags/McAfee/"},{"name":"Bitcoin","slug":"Bitcoin","permalink":"http://hodlerstreet.com/tags/Bitcoin/"},{"name":"Cryptocurrency","slug":"Cryptocurrency","permalink":"http://hodlerstreet.com/tags/Cryptocurrency/"},{"name":"Blockchain","slug":"Blockchain","permalink":"http://hodlerstreet.com/tags/Blockchain/"}]}]}