{"meta":{"title":"HodlerStreet","subtitle":"HodlerStreet","description":null,"author":"Rohan Agarwal","url":"http://hodlerstreet.com"},"pages":[{"title":"about","date":"2018-01-06T19:08:01.000Z","updated":"2018-01-06T19:11:19.642Z","comments":true,"path":"about/index.html","permalink":"http://hodlerstreet.com/about/index.html","excerpt":"","text":""},{"title":"coming soon","date":"2018-01-06T20:01:33.000Z","updated":"2018-01-07T12:21:00.830Z","comments":true,"path":"coming/index.html","permalink":"http://hodlerstreet.com/coming/index.html","excerpt":"","text":""}],"posts":[{"title":"Introduction to Hardware Wallet in Crypto World","slug":"2","date":"2018-01-07T11:00:00.000Z","updated":"2018-01-07T12:21:00.824Z","comments":true,"path":"2018/01/07/2/","link":"","permalink":"http://hodlerstreet.com/2018/01/07/2/","excerpt":"","text":"OverviewA hardware wallet is a special type of crypto wallet which stores user’s private keys in a secure hardware device. Two major utilized cryptocurrency hardware wallets currently are Trezor and Ledger. Major advantages over standard wallets are: Private keys are stored in a protected area of a microcontroller, and cannot be transferred out of the device in plain text. Immune to computer viruses that steal from software wallets. Can be used securely and interactively, as opposed to a paper wallet which must be imported to software at some point. Much of the time, the software is open-source allowing a user to validate the entire operation of the device. The main principle behind the hardware wallets is to provide the full isolation between the cryptographic secrets (private keys) and your easy to hack computer or smartphone. Vulnerabilities of modern PCs and smartphones are well known and if you keep your private keys there, it’s just a matter of time before you’ll get hacked and lose your bitcoins. List and briefly explain types of wallets. A paper wallet may be secure, but only until you want to use your funds, requiring importing your private keys on your computer. And if you think a password encrypting your keys is enough, a malware is smart enough to wait for the inevitable decryption before sweeping your funds. Hardware wallets are convenient, affordable, portable and backed up by a paper wallet allowing easy recovery in case of loss. If you have any significant amount of bitcoins, using a hardware wallet should be a no brainer. SeedThe recovery seed usually contains a sequence of 24 words uniquely and securely generated inside your hardware wallet, when you first set it up. It is of utmost importance to keep this backup sentence secret and safe. In case your wallet is lost you can recover your wallet with recovery seed. Trezor Wallet Trezor is the hardware device that hosts the wallet. As in a normal wallet that we use on a daily basis there are pouches for different things like one for driving licence and other for money and further sections depending on the stuff you are carrying. Similarly wallet in Trezor, there are separate pouches for different currencies one for Bitcoin, one for Ethereum, also for your U2F identity, etc. Everything you need is in one wallet. Each seed generates only one wallet. Unlike a wallet, for which you only have one per seed, you can have many accounts (for every currency separately). Compare this to your bank accounts — you might have a Checking account and a Savings account. As they are separate accounts, they are completely independent, save from the fact that they are generated from the same seed. Account 1 does not see what is in Account 2, etc. Ledger Nano S Ledger Nano S is a secure Bitcoin and Ethereum hardware wallet. It connects to any computer through USB and embeds a built-in OLED display to double check and confirm each transaction with a single tap on its side buttons. To date there have been no verifiable incidents of Bitcoins stolen from hardware wallets. Hardware wallets are relatively new, but at least for the time being they have maintained a good track record, unlike the numerous incidents of Bitcoin theft from Internet-connected computers. How a hardware wallet cannot protect your Bitcoins Malware swaps recipient bitcoin address - During serial communication when recipient address in sent to hardware device for signing the transaction, malware can swap the actual address and the transaction would be signed for hacker’s bitcoin address. Insecure RNG (Random Number Generator) - hardware wallets rely on the security of an RNG, often embedded in hardware, to generate your wallet’s private keys securely. Unfortunately, it is notoriously difficult to verify the true randomness of the RNG. An insecure RNG may create wallet keys that can later be recreated by an attacker, by generating pseudo-randomness that would seem statistically indistinguishable from true randomness yet still be predictable to an advanced attacker. Compromised production process - even a perfect software and hardware implementation of a hardware wallet would be vulnerable to a corrupt production process that introduces intentional or unintentional holes into the final product. The introduction of hardware backdoors is a real concern for high risk financial and military applications. References https://cointelegraph.com/news/hardware-bitcoin-wallets-not-vulnerable-to-spectre-attacks-funds-safe https://en.bitcoin.it/wiki/Hardware_wallet https://blog.trezor.io/ https://www.ledger.fr/2016/06/20/ledger-nano-s-secure-multi-currency-hardware-wallet/","categories":[],"tags":[]},{"title":"How serious should a hodler follow McAfee?","slug":"1","date":"2018-01-07T08:17:43.000Z","updated":"2018-01-07T09:55:06.687Z","comments":true,"path":"2018/01/07/1/","link":"","permalink":"http://hodlerstreet.com/2018/01/07/1/","excerpt":"","text":"Someone who has been in the cryptocurrency space sometime now, must have seen McAfee being a dominant figure. The guy is definitely a strong advocate of cryptocurrencies. But the question arises how serious he actually is about cryptocurrencies and whether should someone follow his advice? Well, YES and NO. Why No? Let’s just cut to the chase, he talks shit. I mean, just name the coins he has vouched for over the crypto boom period - DigiByte(DGB), Burst, Kilowatt Hour Coin (KWH), Electronium (ETN) and more. If you go by the backgrounds of the coins he has vouched for, it is awful. Crypto Experts have often criticized him for market manipulation and shouting out coins which really have no core developer team and their projects are a mere marketing gimmick or micro changes on top of really solid crypto projects. Most of the coins have him as an advisor and hence it is quite obvious to see why they appear on his twitter timeline. Recent ICOs like Bob’s Repair are good friends to him, and you shouldn’t be surprised when you see their mention as well. Wait did I mention about his endorsing price. Shhhh…. , it needs to be kept under wraps! Why YES? Even though McAfee lost most of his $100 million fortune he earned through his company, we just cannot neglect the fact that he was one of the greatest internet pioneers of all time. And that blue tick on his twitter is clearly indicative of the fact that he influences decisions. In this case, coins. Cheap ones. One of his tweets made Verge(XVG), a relatively unknown coin surge almost 800% in one week! See for yourself. He is currently buying low market cap coins before tweeting and selling them 2x to 5x profit after the wave travels. Recently, he has started tweeting about one alt each day which are relatively lower in the pecking order in terms of market cap. Massive pumps are being witnessed each day in the coin he tweets about. It’s truly a Christmas come early for day traders who grab a few of those just as he tweets. Easy money I would say! ConclusionAll in all, if you are someone who are haunted by the idea of constant checking of your phone to track micro movements in the prices, day trading is definitely not for you and hence you are better off betting on more stabler coins such as Ethereum, Litecoin or Bitcoin. In such a case, never follow his coins. If you are an opportunist, who wants to remain in this game longer, breath crypto in a more active state and hodl on good coins before they become mainstream, you may look into his coins but DYOR by reading whitepapers before going all in. But if you are someone who lives graphs and are/aspire to become a crypto trader, he is definitely the guy to follow for you. Just take the 2x profit from his coins each day as he announces cheap alts and sell before the dawn in your quest to become a crypto millionaire. If you found the article helpful, please share and subscribe to our social media channels. Sourcehttps://i.ytimg.com/vi/fKP0C8zA7_Q/maxresdefault.jpg http://cdni.wired.co.uk/1240x826/k_n/McAfee.jpg https://img.thedailybeast.com/image/upload/v1492109455/articles/2016/09/12/libertarian-presidential-hopeful-john-mcafee-accused-of-rape-and-murder-in-explosive-new-doc/160911-Yamato-Gringo-The-Dangerous-Life-of-John-McAfee-tease_zmt qjg.jpg","categories":[],"tags":[{"name":"Crypto","slug":"Crypto","permalink":"http://hodlerstreet.com/tags/Crypto/"},{"name":"Hodlerstreet","slug":"Hodlerstreet","permalink":"http://hodlerstreet.com/tags/Hodlerstreet/"},{"name":"Hodler","slug":"Hodler","permalink":"http://hodlerstreet.com/tags/Hodler/"},{"name":"McAfee","slug":"McAfee","permalink":"http://hodlerstreet.com/tags/McAfee/"},{"name":"Bitcoin","slug":"Bitcoin","permalink":"http://hodlerstreet.com/tags/Bitcoin/"},{"name":"Cryptocurrency","slug":"Cryptocurrency","permalink":"http://hodlerstreet.com/tags/Cryptocurrency/"},{"name":"Blockchain","slug":"Blockchain","permalink":"http://hodlerstreet.com/tags/Blockchain/"}]}]}